## Terraform Plan Result
```
module.networking.aws_route53_zone.main: Refreshing state... [id=Z0632518T07Q6W1XR2EO]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-08d7ba50acedfcfb5]
module.networking.aws_acm_certificate.acm: Refreshing state... [id=arn:aws:acm:ap-northeast-1:695394391597:certificate/a69b72b5-640f-4759-b2b1-cd0e57ed85f1]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-078f82545b4e2dcd6]
module.vpc.aws_subnet.public["public2"]: Refreshing state... [id=subnet-0d5950f212728c9d2]
module.vpc.aws_subnet.private["private2"]: Refreshing state... [id=subnet-03053a9cbedd391da]
module.security_group.aws_security_group.security_group["ec2_sg"]: Refreshing state... [id=sg-078ae20d4abbff3b9]
module.security_group.aws_security_group.security_group["vpc_endpoint_sg"]: Refreshing state... [id=sg-006f952ff5ea6a783]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-tg/c16b62756dfaef59]
module.security_group.aws_security_group.security_group["rds_sg"]: Refreshing state... [id=sg-07b32ece1ee5dd62d]
module.vpc.aws_subnet.public["public1"]: Refreshing state... [id=subnet-0f87d51d5d8cb3a99]
module.vpc.aws_subnet.private["private1"]: Refreshing state... [id=subnet-0445cbf61109b748f]
module.security_group.aws_security_group.security_group["alb_sg"]: Refreshing state... [id=sg-00bf581bf09aec105]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0a20677a95abf610d]
aws_security_group_rule.vpc_endpoint_egress: Refreshing state... [id=sgrule-1279334969]
aws_security_group_rule.alb_ingress_https: Refreshing state... [id=sgrule-623292272]
aws_security_group_rule.allow_alb_to_ec2: Refreshing state... [id=sgrule-3668962198]
aws_security_group_rule.alb_ingress_http: Refreshing state... [id=sgrule-2665938848]
aws_security_group_rule.ec2_egress: Refreshing state... [id=sgrule-246775728]
aws_security_group_rule.allow_ec2_to_rds: Refreshing state... [id=sgrule-1318624851]
aws_security_group_rule.alb_to_ec2: Refreshing state... [id=sgrule-3439544137]
module.asg.aws_launch_template.lt: Refreshing state... [id=lt-0a0959d020c858f5d]
aws_security_group_rule.vpc_endpoint_ingress: Refreshing state... [id=sgrule-2192399666]
module.vpc.aws_route_table_association.public["public1"]: Refreshing state... [id=rtbassoc-0cfdcfe5a3b93f44f]
module.vpc.aws_route_table_association.public["public2"]: Refreshing state... [id=rtbassoc-0dfcc9cd8b78e8963]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-07bfa89fbc256ba30]
module.vpc_endpoint.aws_vpc_endpoint.interface["ssmmessages"]: Refreshing state... [id=vpce-02a8a43944fc5aee5]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-alb/c2cd3b5c68d9678b]
module.vpc_endpoint.aws_vpc_endpoint.interface["ecr.dkr"]: Refreshing state... [id=vpce-05b716879bf6dc92f]
module.vpc_endpoint.aws_vpc_endpoint.interface["events"]: Refreshing state... [id=vpce-0ecb8a91480162d18]
module.vpc_endpoint.aws_vpc_endpoint.interface["logs"]: Refreshing state... [id=vpce-0248353a3ecd5571c]
module.vpc_endpoint.aws_vpc_endpoint.interface["sts"]: Refreshing state... [id=vpce-0d4cdfb00c4c368e2]
module.vpc_endpoint.aws_vpc_endpoint.interface["monitoring"]: Refreshing state... [id=vpce-034965c9c1a121262]
module.vpc_endpoint.aws_vpc_endpoint.interface["ecr.api"]: Refreshing state... [id=vpce-0829411f1b046359a]
module.vpc_endpoint.aws_vpc_endpoint.interface["ssm"]: Refreshing state... [id=vpce-00c20288204f8bdc3]
module.vpc_endpoint.aws_vpc_endpoint.interface["ec2messages"]: Refreshing state... [id=vpce-0f76137c3e29750dc]
module.rds.aws_db_subnet_group.db_subnet_group: Refreshing state... [id=testapp-dev-db-subnet-group]
module.asg.aws_autoscaling_group.asg: Refreshing state... [id=testapp-dev-asg]
module.vpc.aws_route_table_association.private["private2"]: Refreshing state... [id=rtbassoc-020eedbf84ee540a9]
module.vpc.aws_route_table_association.private["private1"]: Refreshing state... [id=rtbassoc-0fdd4bbe513874bcc]
module.alb.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/c2cd3b5c68d9678b/feb0b24673429e87]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/c2cd3b5c68d9678b/df38d530a6153ead]
module.vpc_endpoint.aws_vpc_endpoint.gateway["s3"]: Refreshing state... [id=vpce-0033f02262656e707]
module.vpc_endpoint.aws_vpc_endpoint.gateway["dynamodb"]: Refreshing state... [id=vpce-072b14069fbabee1e]
module.rds.aws_db_instance.dbinstance: Refreshing state... [id=db-2WTTHPLA7DEBH2LUKQZK3W5JOE]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "testapp-dev-nat-eip"
        }
      + tags_all             = {
          + "Name" = "testapp-dev-nat-eip"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0f87d51d5d8cb3a99"
      + tags                               = {
          + "Name" = "testapp-dev-nat"
        }
      + tags_all                           = {
          + "Name" = "testapp-dev-nat"
        }
    }

  # module.vpc.aws_route_table.private will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-07bfa89fbc256ba30"
      ~ route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
        tags             = {
            "Name" = "testapp-dev-private-rt"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentterraform-plan -->